Revit 2027 API
RebarBendData.CrankRatio0 Property
Identifies the crank ratio at the start. The 1:crankRatio that defines the crank slope.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CrankRatio0 { get; }
Public ReadOnly Property CrankRatio0 As Double
	Get
public:
property double CrankRatio0 {
	double get ();
}
member CrankRatio0 : float with get
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace